[
  {
    "Post": "In this #McKAuthorTalks, PepsiCo's first ever Chief Design Officer Mauro Porcini discusses his book The Human Side of Innovation: The Power of People in Love with People.\nInnovation doesn't happen by accident - you need teams with the right mindset to power the journey \nLearn more: https://mck.co/3Q54Jz9",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "Companies across industries tend to discuss headwinds rather than tailwinds - but why? \nMcKinsey research shows that transparent messaging is essential for companies to maintain credibility with shareholders: https://mck.co/3VblABk",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "Global integration is evolving, not retreating.\nMGI analysis of 6,000 globally traded products suggests that those whose origins are concentrated in a few geographies are found in every sector, region, and stage of the production process: mck.co/GlobalFlows",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "General and administrative functions must adapt to make use of advanced digital technologies and support a globally dispersed workforce. https://mck.co/3Z3TESY",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "What we put into our bodies, how we spend our time, when and how we move, what our minds and bodies are exposed to, and what we believe about the nature of reality, ourselves, and other people all influence our health.\nWe’ve identified 23 modifiable drivers of health – most of which sit outside the conventional healthcare system. This has major implications for governments, employers, and leaders. \nLearn more: https://mck.co/3Z0UT5y… See moreSee more",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "Co-author of #TitaniumEconomyBook Nick Santhanam spoke with Motley Fool Money Podcast host Ricky Mulvey to talk about the core themes within #TitaniumEconomyBook. Listen to an excerpt where Nick discusses the talent shortage and the opportunities for high-paying jobs within the industrial sector. \nhttps://mck.co/3Iic9x0",
    "Link": "",
    "PostId": "https://www.facebook.com/1234762327120413",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "So, what just happened? \n As 2022 draws to a close, McKinsey Global Publishing is sharing a month-by-month breakdown of crucial inflection points, themes, and insights that defined the year. \nExplore our special #YearInReview collection herehttps://mck.co/3jKJgza",
    "Link": "",
    "PostId": "https://www.facebook.com/886470395725792",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "Today, more than half of the world’s banks continue to struggle with profitability and have a return on equity that is below their cost of capital.\nBut all banks everywhere can focus now on improving their short-term resilience and embracing longer-term opportunities. The latest report examines those strategies that have allowed some players to rise above the fray and outperform.\nDownload your copy nowhttps://mck.co/3WBxvK2… See moreSee more",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "Excessive debt carries more systemic risk than boomtime accounting can adequately reckon with.\nThe Great Recession demonstrated the value of capital discipline. Here's how US-based leaders can put those lessons to work. https://mck.co/3vtsJCI",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "Happy new year\nWishing everyone a healthy, happy, and prosperous 2023.",
    "Link": "",
    "PostId": "https://www.facebook.com/896273538084386",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "What does it take to be a high-performing CEO? To find out, don’t miss the new CNBC-TV18 series, 'Winning Mindset: The CEO Guidebook'.  \nThe series is based on #CEOExcellenceBook, The New York Times best-seller from Vik Malhotra, Carolyn Dewar, and Scott Keller.  It investigates what CEO Excellence means in the Indian business ecosystem – with new insights from some of India’s most successful CEOs  https://bit.ly/3jnunD3  \n#Leadership #McKinsey #CEOExcellenceBook #India… See moreSee more",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "#Frontlineworkers remain the heartbeat of organizations.\nHow can we ensure they stay motivated and supported?\nIt's time to make sure their voices are heard.… See moreSee more",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "You’ll probably spend 20 to 30 years in mixed (at best) health and about a decade in awful health.\nBefore you embark on another set of health-related resolutions this New Year’s Day, check out these insights on achieving great health, and much more. https://mck.co/3Im6qWS",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": " Open standards Interoperability Energy management\nScaling electric vehicle infrastructure will help shape the charging industry as it continues its evolution.… See moreSee more",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "Much of the industrial sector is thriving, brimming with innovation, offering high-quality jobs with good pay and benefits, and producing strong financial returns. #TitaniumEconomyBook formally recognizes this sector as the vital core of the US economy. \nThank you for your commentary Blake, #TitaniumEconomyBook should be required reading for those passionate about the future of manufacturing. \nhttps://mck.co/3jgDHZ4",
    "Link": "",
    "PostId": "https://www.facebook.com/1826375534365348",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "Getting to #netzero and preventing #climate disaster means big risks--and big opportunities for businesses that take bold action. Learn more with our Explainers series, available now in in the Insights app. https://mck.co/3Wmrr87\n#McKExplainers",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "From helping to build and maintain networks at work to improving advancement opportunities, organizations have many ways to support their frontline talent. Discover how to create a better employee experience for these critical workers: https://mck.co/3O2m2zU\n#Talent #FrontlineWorkers #EmployeeExperience",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "High turnover, shrinking pipelines, inflation—the talent market remains in flux.\nIn this episode of the McKinsey Talks Talent podcast, Bonnie Dowling, Bryan Hancock, and Bill Schaninger discuss recent research on the volatile talent landscape and what leaders should be doing now to gain traction.\nTune in—or read a transcript of their conversation—to learn more: https://mck.co/3FE05Vk… See moreSee more",
    "Link": "",
    "PostId": "https://www.facebook.com/3346161232304035",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  },
  {
    "Post": "In times of crisis, extraordinary leaders respond to challenges in a way that enables their teams and organizations to thrive. How do they do it? Deliberate Calm: How to Learn and Lead in a Volatile World explores the practices that help leaders respond intentionally and thoughtfully in uncertain, high-pressured situations. \nTune in to The McKinsey Podcast to find out more: https://mck.co/3SClEIR \n#DeliberateCalmBook #Leadership #Adaptability",
    "Link": "",
    "PostId": "",
    "Image": "",
    "Shares": "",
    "Comments": "",
    "Reactions": ""
  }
]
